/*******************************(C) COPYRIGHT 2017 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : OS_StartFile.c
* @Description : 系统启动文件
* @Date        : 2016/3/15
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@qq.com
* @Platform    : Keil uVision5 v5.15 (STM32L151CB)
* @Explain     :  
------------------------------------------------------------------------------- 
修订记录：	
 @Date		@Version			@Revise					@Author
2016/3/15	WindOS3.1.01		WindOS3问世				Wind（谢玉伸）
2017/10/16	WindOS3.2.01		初始化位置改变			Wind（谢玉伸）
2017/10/16	WindOS3.2.02		修复Free的BUG			Wind（谢玉伸）
2017/11/03	WindOS3.3.01		重大更新				Wind（谢玉伸）

最后修订：
1.系统版本更新在这个文件，其他文件有各自的文件版本号。
2.增加休眠功能。 
3.所有App的函数体都更改为void FunName(void)。
4.运行槽的范围改为32位（0~4294967296）。
5.删除了不常用的“挂起状态”和“运行一次状态”。
6.原来的“挂起程序”改为了“睡眠程序”。
7.创建App时误填编译器会发出警告。
8.增加了系统Hal抽象层文件 OS_Hal OS_UI_Hal。移植时填写这两个文件即可。 
*=============================================================================*/       

/* 头文件包含 ----------------------------------------------------------------*/
#include "OS_StartFile.h"

/* 私有宏定义 ----------------------------------------------------------------*/

/* 私有（静态）函数声明 -------------------------------------------------------*/

/* 全局变量定义 --------------------------------------------------------------*/
uint32_t OS_Msg = NULL;	
uint32_t OS_Error = NULL;	
uint16_t OS_TimeOver_Cnt = NULL; 

/* 全局函数编写 --------------------------------------------------------------*/   

/**----------------------------------------------------------------------------
* @FunctionName  : OS_Init()     
* @Description   : WinOS初始化 
* @Data          : 2016/3/15
* @Explain       : None
------------------------------------------------------------------------------*/
inline void OS_Init(void)
{	    
	Tools_ChipID_Get();
} 
			
			
 



 


/*******************************(C) COPYRIGHT 2017 Wind（谢玉伸）*********************************/





