/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : AppTaskbar.h
* @Description : None
* @Date        : 2016/3/15
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5 v5.15 (STM32F407ZG)
* @Explain     : None
*=============================================================================*/

/* 防止重调用 ----------------------------------------------------------------*/
#ifndef __APPTASKBAR_H
#define __APPTASKBAR_H 

/* 头文件包含 ----------------------------------------------------------------*/  
#include "My_Library.h" 

/* 全局宏定义 ----------------------------------------------------------------*/


enum __TASKBAR_STATE
{
	 BAR_PRESS = 0x10,
	 BAR_FREE,  
	 BAR_ACTIVATE,  
	 BAR_CLOSE,
	 BAR_FIRST,
	 BAR_RUNNING
};

enum __TASKBAR_ACTIVE
{ 
	 BAR_UP = 0x20,
	 BAR_DOWN

};

/* 结构体声明 ----------------------------------------------------------------*/ 
typedef struct __Taskbar
{
	u8 activate_point;		//状态栏激活点
	u16 dynamic_Y;    //激活状态下的 触摸位置
	u8 activate_state;  //是否为激活状态
	u8  run_state; 		//状态栏运行状态
}TypeTaskbar;

/* 全局变量声明 --------------------------------------------------------------*/ 

/* 全局函数声明 --------------------------------------------------------------*/   
unsigned int AppTaskbar(void);  

#endif				
/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/













