/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : main.c
* @Description : None
* @Date        : 2016/3/15
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5 v5.15 (STM32F407ZG)
* @Explain     : None
*=============================================================================*/

/* 头文件包含 ----------------------------------------------------------------*/ 
#include "OS_StartFile.h" 

/* 私有宏定义 ----------------------------------------------------------------*/

/* 私有（静态）函数声明 -------------------------------------------------------*/

/* 全局变量定义 --------------------------------------------------------------*/

/* 全局函数编写 --------------------------------------------------------------*/
/**----------------------------------------------------------------------------
* @FunctionName  : main()     			
* @Description   : None 		
* @Data          : 2016/3/15		
* @Explain       : None			
------------------------------------------------------------------------------*/
int main()					
{
	  
	/* WindOS初始化 --------------------------------*/						
	OS_Init();  															
																	
	/* 空闲程序注册(挂载) ---------------------------*/	    							
//	OSTask_Creat(OSCPU_Show,(u8*)"OSCPU_Show.wos",20,OS_STATE_SUSPEND,OS_THREAD_FREE);	
	
	
	/* 主程序注册 ----------------------------------*/	    
//	OSTask_Creat(APP_Hello,(u8*)"APP_Hello.wos",50,OS_STATE_SUSPEND,OS_THREAD_PRIMARY);    	 
//	OSTask_Creat(App_Read_ScreenID,(u8*)"App_Read_ScreenID.wos",300,OS_STATE_SUSPEND,OS_THREAD_PRIMARY);	
//	OSTask_Creat(APP_Flash,(u8*)"APP_Flash.wos",100,OS_STATE_SUSPEND,OS_THREAD_PRIMARY);
	OSTask_Creat(&App_LED);
	OSTask_Creat(&APP_TouchDraw); 
	
	/* 系统程序注册(挂载) --------------------------*/										
	
	/* WindOS空闲程序 -----------------------------*/  		
	while(1) OSThread_Free();   										
																
			
}




/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/





