/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : OS_Manage.h
* @Description : None
* @Date        : 2016/3/15
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5 v5.15 (STM32F407ZG)
* @Explain     : None
*=============================================================================*/

/* 防止重调用 ----------------------------------------------------------------*/
#ifndef __OS_MANAGE_H  
#define __OS_MANAGE_H   
								
/* 头文件包含 ----------------------------------------------------------------*/  

/* 全局宏定义 ----------------------------------------------------------------*/
typedef unsigned int(Creatfun)(void); //App 函数定义必须是 unsigned int XXX(void)  

/* 结构体声明 ----------------------------------------------------------------*/ 
typedef struct __AppMember
{ 
	unsigned char name[10];
	unsigned char prioity; //优先级
	unsigned char period;  //运行周期
	unsigned char state;   //运行状态
	Creatfun *AppFun;   
	
	struct __AppMember *next; 
	struct __AppMember *last; 
}Type_Addr;//环形队列成员 


/* 全局变量声明 --------------------------------------------------------------*/ 

/* 全局函数声明 --------------------------------------------------------------*/  
void OS_Init(void);


#endif
/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/



