/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : OS_Manage.c
* @Description : None
* @Date        : 2016/3/15
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5 v5.15 (STM32F407ZG)
* @Explain     : None
*=============================================================================*/

/* 头文件包含 ----------------------------------------------------------------*/
#include "OS_Manage.h"
#include "AppList.h" 

 

/* 私有宏定义 ----------------------------------------------------------------*/

/* 私有（静态）函数声明 ------------------------------------------------------*/ 

/* 全局变量定义 --------------------------------------------------------------*/
unsigned long int OS_RAM = 0; //RAM计数
Type_Addr AppHead = {NULL,NULL,NULL,NULL,NULL,NULL,NULL}; //定义程序运行的头帧
Type_Addr *pTemp = &AppHead;  
	
/* 全局函数编写 --------------------------------------------------------------*/
/**----------------------------------------------------------------------------
* @FunctionName  : OS_Init()     
* @Description   : None 
* @Data          : 2016/3/15
* @Explain       : WinOS初始化
------------------------------------------------------------------------------*/
void OS_Init(void)
{		
	 
	/* WindOS初始化 ------------------------------------*/  
	
	/* 硬件初始化 --------------------------------------*/
	Drive_Init(); 
	
}			

 
	
/**----------------------------------------------------------------------------
* @FunctionName  : OSTask_Creat()     
* @Description   : None 
* @Data          : 2016/3/16
* @Explain       : WinOS任务创建
------------------------------------------------------------------------------*/	
void OSTask_Creat(Creatfun *_AppAddr,unsigned char *_Name,unsigned int _Level) 
{  
	Type_Addr *p = (Type_Addr*)malloc(sizeof(Type_Addr)); //申请内存 			
	pTemp ->next = p;    
	p ->last = pTemp; 			
	pTemp = p; 		
	p ->AppFun = _AppAddr;     
	p ->next = AppHead.next; 
	
//	OS_RAM += sizeof(Creatfun); //记录OS使用的内存数量	 					
}




/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/





