/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : App_Test.c
* @Description : None
* @Date        : 2016/9/8
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5 v5.15 (STM32F407ZG)
* @Explain     : None
*=============================================================================*/

/* 头文件包含 ----------------------------------------------------------------*/
#include "App_Test.h"  
 
/* 私有宏定义 ----------------------------------------------------------------*/

/* 私有（静态）函数声明 ------------------------------------------------------*/

/* 全局变量定义 --------------------------------------------------------------*/ 

/* 全局变量声明 --------------------------------------------------------------*/ 


/* 全局函数编写 --------------------------------------------------------------*/
/**----------------------------------------------------------------------------
* @FunctionName  : App_Test()     
* @Description   : None 
* @Data          : 2016/3/15
* @Explain       : None
------------------------------------------------------------------------------*/
unsigned int Test_Main(void)		
{   
//	static u16 cnt = 0;
	
//	u16 tempX = 0xffff,tempY = 0xffff; 
//	GT9147_Scan(0);
//	
//	tempX = tp_dev.x[0];
//	tempY = tp_dev.y[0];
//	 
//	
//  OS_TextColor_Set(WHITE);    
//	OS_BackColor_Set(BLACK);    
//	OS_Num_Show(0,0,tempX,6,FONT_3,1);
//	OS_Num_Show(100,0,tempY,6,FONT_3,1);
//	
//	OS_Num_Show(400,700,cnt++,6,FONT_3,1);
//	
	
	return 0;
}	

unsigned int Test_Start(void)		
{     
//	 tp_dev.init();  
//	 GT9147_Init();
	return 0;
}

Type_AppList App_Test = {Test_Main,NULL,Test_Start,NULL, \
						OS_STATE_ACTIVE,OS_THREAD_PRIMARY, \
						(u8*)"LED",100,NO_USE_OS_ICO};			
																
																				
/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/





