/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : App_Flash.c
* @Description : None
* @Date        : 2016/4/10
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5 v5.15 (STM32F407ZG)
* @Explain     : None
*=============================================================================*/             

/* 头文件包含 ----------------------------------------------------------------*/          
#include "App_Flash.h" 	


/* 私有宏定义 ----------------------------------------------------------------*/

/* 私有（静态）函数声明 ------------------------------------------------------*/

/* 全局变量定义 --------------------------------------------------------------*/
 
/* 全局函数编写 --------------------------------------------------------------*/
/**----------------------------------------------------------------------------  
* @FunctionName  : Flash()     
* @Description   : None 
* @Data          : 2016/4/10	
* @Explain       : None
------------------------------------------------------------------------------*/
unsigned int Flash_Main(void)  
{ 
								
									
	return 0; 
}


unsigned int Flash_Start(void)
{
	
	 	 
	return 0;
}


unsigned int Flash_End(void)
{
	
	  
	return 0;
}


Type_AppList APP_Flash = {Flash_Main,NULL,Flash_Start,Flash_End, \
							OS_STATE_CLOSE_ON,OS_THREAD_PRIMARY, \
							(u8*)"Flash",200,USE_OS_DESKTOP};			
		

/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/





