/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/
/**============================================================================
* @FileName    : App_Read_ScreenID.c
* @Description : None
* @Date        : 2016/3/31
* @By          : Wind（谢玉伸）
* @Email       : 1659567673@ qq.com
* @Platform    : Keil uVision5 v5.15 (STM32F407ZG)
* @Explain     : None
*=============================================================================*/             

/* 头文件包含 ----------------------------------------------------------------*/          
#include "App_Read_ScreenID.h" 
#include "OS_StartFile.h" 

/* 私有宏定义 ----------------------------------------------------------------*/

/* 私有（静态）函数声明 ------------------------------------------------------*/

/* 全局变量定义 --------------------------------------------------------------*/
 
/* 全局函数编写 --------------------------------------------------------------*/
/**----------------------------------------------------------------------------  
* @FunctionName  : App_Read_ScreenID()     
* @Description   : None 
* @Data          : 2016/3/31
* @Explain       : None
------------------------------------------------------------------------------*/
unsigned int App_Read_ScreenID(void)  
{  
	 OS_String_Show(50,100,(u8*)"读取屏幕的ID",FONT_3); 
	 OS_Num_Show(50,160,lcddev.id,8,FONT_3);		 
	 return 0;
}
 

unsigned int App_Read_ScreenID_Start(void)
{
	Taskbar_Draw(FONT_1); 
	return 0;
}


unsigned int App_Read_ScreenID_End(void)
{
	Taskbar_Draw(FONT_1); 
	return 0;
}
 

/*******************************(C) COPYRIGHT 2016 Wind（谢玉伸）*********************************/





